Revit 2024 API
FormattedText.GetSubscriptStatus Method
 Returns whether All, None or a Mixed of characters in the entire text are subscripted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public FormatStatus GetSubscriptStatus()
Visual Basic
Public Function GetSubscriptStatus As FormatStatus
Visual C++
public:
FormatStatus GetSubscriptStatus()
Return Value
 The format status of subscript on characters FormatStatus.
Remarks
 This function only returns All or None if the entire text contains one character.
See Also
FormattedText Class
GetSubscriptStatus Overload
Autodesk.Revit.DB Namespace